RestAssured_API_Testing/SOAP Request/Add.XML

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <a>5</a>
            <b>2</b>
        </Add>
    </Body>
</Envelope>